app/views/dashboard/index.html.erb

SELECT "especialidades"."nome" FROM "especialidades" INNER JOIN "medico_especialidades" ON "especialidades"."id" = "medico_especialidades"."especialidade_id" WHERE "medico_especialidades"."medico_id" = 1
---
                  <div class="doctor-specialty">
                    <%= medico.especialidades.pluck(:nome).join(', ') %>