app/views/agendamentos/index.html.erb

SELECT COUNT(*) FROM "medicos" INNER JOIN "medico_especialidades" ON "medicos"."id" = "medico_especialidades"."medico_id" WHERE "medico_especialidades"."especialidade_id" = 5 AND "medicos"."ativo" = 1
---
            <div class="medicos-count">
              <%= pluralize(especialidade.medicos.where(ativo: true).count, 'médico') %> disponível