app/controllers/agendamentos_controller.rb

SELECT DISTINCT "especialidades".* FROM "especialidades" INNER JOIN "medico_especialidades" ON "medico_especialidades"."especialidade_id" = "especialidades"."id" INNER JOIN medicos ON medicos.id = medico_especialidades.medico_id WHERE "medicos"."ativo" = 1 ORDER BY "especialidades"."nome" ASC
---
  def index
    # Página inicial do agendamento - escolher especialidade
    @especialidades = Especialidade.joins(:medico_especialidades)
                                   .joins("INNER JOIN medicos ON medicos.id = medico_especialidades.medico_id")
                                   .where(medicos: { ativo: true })
                                   .distinct
                                   .order(:nome)

SELECT "especialidades".* FROM "especialidades" WHERE "especialidades"."id" = 5 LIMIT 1
SELECT "medicos".* FROM "medicos" INNER JOIN "medico_especialidades" ON "medicos"."id" = "medico_especialidades"."medico_id" WHERE "medico_especialidades"."especialidade_id" = 5 AND "medicos"."ativo" = 1
---
  def medicos
    # Listar médicos da especialidade escolhida
    @especialidade_id = params[:especialidade_id]
    @especialidade = Especialidade.find(@especialidade_id) if @especialidade_id.present?

    if @especialidade
      @medicos = @especialidade.medicos.where(ativo: true).includes(:especialidades)

SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = 4 LIMIT 1
SELECT "especialidades".* FROM "especialidades" WHERE "especialidades"."id" = 5 LIMIT 1
SELECT "agendas".* FROM "agendas" WHERE "agendas"."medico_id" = 4 AND (data_inicio <= '2025-10-28' AND (data_fim IS NULL OR data_fim >= '2025-10-28')) ORDER BY "agendas"."id" ASC LIMIT 1
---
  def horarios
    # Mostrar horários disponíveis do médico escolhido
    @medico_id = params[:medico_id]
    @especialidade_id = params[:especialidade_id]
    @data_selecionada = params[:data].present? ? Date.parse(params[:data]) : Date.tomorrow

    @medico = Medico.find(@medico_id) if @medico_id.present?
    @especialidade = Especialidade.find(@especialidade_id) if @especialidade_id.present?

    if @medico.nil? || @especialidade.nil?
      redirect_to agendamento_path, alert: 'Dados incompletos. Reinicie o agendamento.'
      return
    end

    # Buscar agenda do médico
    @agenda = @medico.agendas.where(
      'data_inicio <= ? AND (data_fim IS NULL OR data_fim >= ?)',
      @data_selecionada, @data_selecionada
    ).first