app/controllers/application_controller.rb

  def current_usuario
    return @current_usuario if defined?(@current_usuario)
    if session[:usuario_id]
      @current_usuario = Usuario.find_by(id: session[:usuario_id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1