app/controllers/consultas_controller.rb

  def index
    # Médicos veem apenas suas consultas; outros veem todas
    if usuario_signed_in? && current_usuario.papel == 'medico'
      @consultas = Consulta.where(medico: current_usuario.medico).order(inicio: :desc)
    else
      @consultas = Consulta.order(inicio: :desc).limit(50)
---
SELECT "consultas".* FROM "consultas" ORDER BY "consultas"."inicio" DESC LIMIT 50

  def show
    @consulta = Consulta.find(params[:id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = 4 LIMIT 1

  def create
    @consulta = Consulta.new(consulta_params)
    if @consulta.save
---
INSERT INTO "consultas" ("paciente_id", "medico_id", "unidade_id", "sala_id", "especialidade_id", "inicio", "fim", "tipo", "status", "origem", "observacoes", "created_at", "updated_at") VALUES (4, 1, 1, 1, 1, '2025-10-03 11:45:37', '2025-10-03 14:14:00', 'presencial', 'marcada', 'app', NULL, '2025-10-02 11:45:59.352164', '2025-10-02 11:45:59.352164') RETURNING "id"