app/controllers/consultas_controller.rb

  def index
    # Base da consulta - médicos veem apenas suas consultas; outros veem todas
    consultas_base = if usuario_signed_in? && current_usuario.papel == 'medico'
      Consulta.where(medico: current_usuario.medico)
    else
      Consulta.all
    end

    # Aplicar filtros
    consultas_base = consultas_base.includes(:paciente, :medico, :unidade, :especialidade, :sala)

    # Filtro por status
    if params[:status].present? && params[:status] != 'todos'
      consultas_base = consultas_base.where(status: params[:status])
    end

    # Filtro por médico (apenas para admin/atendente)
    if params[:medico_id].present? && params[:medico_id] != 'todos' &&
       (current_usuario.papel == 'admin' || current_usuario.papel == 'atendente')
      consultas_base = consultas_base.where(medico_id: params[:medico_id])
    end

    # Filtro por período
    if params[:data_inicio].present?
      consultas_base = consultas_base.where('inicio >= ?', Date.parse(params[:data_inicio]))
---
SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = 1 LIMIT 1
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = 1 LIMIT 1
SELECT "unidades".* FROM "unidades" WHERE "unidades"."id" = 1 LIMIT 1

  def show
    @consulta = Consulta.find(params[:id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = 4 LIMIT 1

  def new
    @consulta = Consulta.new
    @medicos = Medico.ativos
    @pacientes = Paciente.ativos
    @unidades = Unidade.all
    @especialidades = Especialidade.all
    @salas = Sala.where(ativa: true)
---
SELECT "unidades".* FROM "unidades"
SELECT "especialidades".* FROM "especialidades"
SELECT "salas".* FROM "salas" WHERE "salas"."ativa" = 1

  def create
    @consulta = Consulta.new(consulta_params)
    if @consulta.save
      redirect_to @consulta, notice: 'Consulta criada com sucesso.'
    else
      @medicos = Medico.ativos
      @pacientes = Paciente.ativos
      @unidades = Unidade.all
      @especialidades = Especialidade.all
      @salas = Sala.where(ativa: true)
---
INSERT INTO "consultas" ("paciente_id", "medico_id", "unidade_id", "sala_id", "especialidade_id", "inicio", "fim", "tipo", "status", "origem", "observacoes", "created_at", "updated_at") VALUES (4, 1, 1, 1, 1, '2025-10-03 11:45:37', '2025-10-03 14:14:00', 'presencial', 'marcada', 'app', NULL, '2025-10-02 11:45:59.352164', '2025-10-02 11:45:59.352164') RETURNING "id"
SELECT "unidades".* FROM "unidades"
SELECT "especialidades".* FROM "especialidades"
SELECT "salas".* FROM "salas" WHERE "salas"."ativa" = 1