app/controllers/dashboard_controller.rb

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."usuario_id" = 14 LIMIT 1
---
  def load_paciente_dashboard
    @paciente = current_usuario.paciente
    consultas_base = Consulta.where(paciente: @paciente)

SELECT "consultas".* FROM "consultas" WHERE "consultas"."paciente_id" = 5 AND (inicio > '2025-10-27 18:16:13.304506') ORDER BY "consultas"."inicio" ASC LIMIT 10
SELECT "medicos".* FROM "medicos" WHERE "medicos"."ativo" = 1 LIMIT 5
---
  def load_admin_dashboard
    consultas_base = Consulta.all

    @consultas_hoje = consultas_base.where(inicio: @hoje.beginning_of_day..@hoje.end_of_day).order(:inicio)
    @consultas_proximas = consultas_base.where('inicio > ?', @agora).order(:inicio).limit(8)

    # Estatísticas gerais
    @stats = {
      consultas_hoje: @consultas_hoje.count,
      consultas_semana: consultas_base.where(inicio: @hoje.beginning_of_week..@hoje.end_of_week).count,
      consultas_mes: consultas_base.where(inicio: @hoje.beginning_of_month..@hoje.end_of_month).count,
      pacientes_ativos: Paciente.where(ativo: true).count,
      medicos_ativos: Medico.where(ativo: true).count,
      pendentes_confirmacao: consultas_base.where(status: 'marcada').where('inicio > ?', @agora).count