app/controllers/sessions_controller.rb

  def create
    usuario = Usuario.find_by(username: params[:username])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."username" = 'admin' LIMIT 1