app/models/bloqueio_agenda.rb

UPDATE "horarios" SET "status" = 'bloqueado' WHERE "horarios"."agenda_id" = 1 AND (inicio >= '2025-10-10 00:19:07.467604' AND fim <= '2025-10-10 02:19:07.467725')
---
  def bloquear_horarios
    agenda.horarios.where('inicio >= ? AND fim <= ?', inicio, fim)
         .update_all(status: 'bloqueado')