app/views/consultas/show.html.erb

        </div>
        <% if @consulta.paciente.cpf.present? %>
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = 4 LIMIT 1

        <% end %>
        <% if @consulta.medico.telefone.present? %>
---
SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = 1 LIMIT 1